"""
1. 已知  numbers = [33,45,67,88,99,22,323,2223,112,23,323,22,232,234,22,112,222,88,111,222,221]
求numbers中所有元素的平均值
"""
numbers = [33, 45, 67, 88, 99, 22, 323, 2223, 112, 23, 323, 22, 232, 234, 22, 112, 222, 88, 111, 222, 221]
sum = 0
i = 0
for num in numbers:
    sum += num
    i += 1
    ping = sum / i
print(ping)

"""
2. 企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；
利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
20万到40万之间时，高于20万元的部分，可提成5%；
40万到60万之间时高于40万元的部分，可提成3%；
60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，
从键盘输入当月利润I，求应发放奖金总数？
"""

i = int(input("请输入本月的利润："))
if i <= 10:
    money = i * 0.1
    print("本月获得的奖金为:{} ".format(money))
elif 10 < i <= 20:
    money = 10 * 0.1 + (i - 10) * 0.075
    # print("本月获得的奖金为:{} ".format(money))
elif 20 < i <= 40:
    money = 10 * 0.1 + 10 * 0.075 + (i - 20) * 0.05
    # print("本月获得的奖金为:{} ".format(money))
elif 40 < i <= 60:
    money = 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + (i - 40) * 0.03
    # print("本月获得的奖金为:{} ".format(money))
elif 60 < i <= 100:
    money = 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 20 * 0.03 + (i - 60) * 0.015
    # print("本月获得的奖金为:{} ".format(money))
elif i > 100:
    money = 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 20 * 0.03 + 40 * 0.015 + (i - 100) * 0.01
print("本月获得的奖金为:{} ".format(money))

"""
3. 优化昨天的代码，将用到print输出的地方改写成格式化输出的形式。可以使用%s格式化，或者使用format进行格式化。
目的：温故知新，同时练习format，%s的用法。

"""

"""
4. 选做题（学有余力的同学可以做一做，一来强化知识，而来锻炼逻辑思维，大脑是越动越灵活的，是需要开发的。）
1）计算从1到1000以内所有能同时被3，5和7整除的数的和并输出 。
2）给定一个整数n，判断是否是质数（质数是只能被1和它自身整除的数） 
3）一球从100米高度自由落下，每次落地后反跳回原高度的一半，再落下。求它在第n次落地时，共经过多少米？ 
"""
sum = 0
for num in range(1, 1001):
    if num % 3 == 0 and num % 5 == 0 and num % 7 == 0:
        sum += num
        print(num, end=" ")
print("")
print(sum)

num = int(input("请输入一个整数："))
for i in range(2, num):
    if num % i == 0:
        print("该数不为质数")
        break
else:
    print("是质数")

n = int(input("请输入球落地的次数："))
i = 1
l = 0
height = 100
while i <= n:
    l = l + height * 2
    height = height / 2
    i += 1
print("总距离为{l}".format(l=l - 100))
